# Pandas.Series 传入不同的输入（数据，全部参数，numpy，字典）

In [1]:
import pandas as pd

In [2]:
a=pd.Series([1,2,3,4,5,6])
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
a=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'],dtype=float)

In [4]:
a

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
dtype: float64

In [6]:

import numpy as np
a=np.arange(5)
b=pd.Series(a)
print(b)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
dic={'name':'lee'
     ,'sex':'Male'
     ,'age':17}
a=pd.Series(dic)
print(a)

name     lee
sex     Male
age       17
dtype: object

自动填充

In [8]:
a=pd.Series(5,[0,1,2])

In [9]:
print(a)

0    5
1    5
2    5
dtype: int64

# DataFrame

带有标签的二维数组
pd.DataFrame(data,index,columns,dtype)

In [10]:
a=np.random.randint(1,10,(2,3))
pd.DataFrame(a,index=['a','b'],columns=['x','y','z'])

   x  y  z
a  6  8  8
b  2  1  7

In [11]:
population={'bj':1888
           ,'sh':1998
           ,'gz':2000}
a=pd.Series(population)
pd.DataFrame(a)

       0
bj  1888
sh  1998
gz  2000

In [12]:
#在上面的基础上加个表头的列名
a=pd.DataFrame(a,columns=['population'])
a

    population
bj        1888
sh        1998
gz        2000

In [17]:
#字典构建
GDP={'bj':240000
    ,'sh':580000
    ,'gz':230000}
pd.DataFrame({'GDP':GDP})

       GDP
bj  240000
gz  230000
sh  580000

In [18]:
pd.DataFrame({'GDP':GDP
             ,'population':population})

       GDP  population
bj  240000        1888
sh  580000        1998
gz  230000        2000

In [19]:
pd.DataFrame({'GDP':GDP
             ,'population':population
             ,'country':'China'})

       GDP  population country
bj  240000        1888   China
sh  580000        1998   China
gz  230000        2000   China

属性

In [20]:
a=pd.DataFrame({'GDP':GDP
             ,'population':population
             ,'country':'China'})
a.values

array([[240000, 1888, 'China'],
       [580000, 1998, 'China'],
       [230000, 2000, 'China']], dtype=object)

In [21]:
a.index

Index(['bj', 'sh', 'gz'], dtype='object')

In [22]:
a.columns

Index(['GDP', 'population', 'country'], dtype='object')

In [24]:
a.shape

(3, 3)

In [25]:
a.size

9

In [26]:
a.GDP

bj    240000
sh    580000
gz    230000
Name: GDP, dtype: int64

In [27]:
a.loc['bj']

GDP           240000
population      1888
country        China
Name: bj, dtype: object

In [28]:
a[a.GDP>0]

       GDP  population country
bj  240000        1888   China
sh  580000        1998   China
gz  230000        2000   China

赋值

In [29]:
a.iloc[0,1]=0
a

       GDP  population country
bj  240000           0   China
sh  580000        1998   China
gz  230000        2000   China

In [30]:
s=pd.Series([1,2,3],index=['bj','sh','gz'])
s

bj    1
sh    2
gz    3
dtype: int64

In [31]:
a['E']=s
a

       GDP  population country  E
bj  240000           0   China  1
sh  580000        1998   China  2
gz  230000        2000   China  3

In [35]:
#数据查看
dates=pd.date_range(start='2020-07-23',periods=6)
dates

DatetimeIndex(['2020-07-23', '2020-07-24', '2020-07-25', '2020-07-26',
               '2020-07-27', '2020-07-28'],
              dtype='datetime64[ns]', freq='D')

In [37]:
df=pd.DataFrame(np.random.randint(0,10,(6,4)),index=dates,columns=['A','B','C','D'])

In [39]:
df

            A  B  C  D
2020-07-23  5  9  9  3
2020-07-24  6  0  5  7
2020-07-25  6  1  5  6
2020-07-26  1  5  5  8
2020-07-27  3  1  5  2
2020-07-28  3  4  7  8

In [41]:
df.describe()

          A         B        C         D
count  6.00  6.000000  6.00000  6.000000
mean   4.00  3.333333  6.00000  5.666667
std    2.00  3.386247  1.67332  2.581989
min    1.00  0.000000  5.00000  2.000000
25%    3.00  1.000000  5.00000  3.750000
50%    4.00  2.500000  5.00000  6.500000
75%    5.75  4.750000  6.50000  7.750000
max    6.00  9.000000  9.00000  8.000000

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2020-07-23 to 2020-07-28
Freq: D
Data columns (total 4 columns):
A    6 non-null int64
B    6 non-null int64
C    6 non-null int64
D    6 non-null int64
dtypes: int64(4)
memory usage: 240.0 bytes

In [44]:
df.head()

            A  B  C  D
2020-07-23  5  9  9  3
2020-07-24  6  0  5  7
2020-07-25  6  1  5  6
2020-07-26  1  5  5  8
2020-07-27  3  1  5  2

In [45]:
#转置
df.T

   2020-07-23  2020-07-24  2020-07-25  2020-07-26  2020-07-27  2020-07-28
A           5           6           6           1           3           3
B           9           0           1           5           1           4
C           9           5           5           5           5           7
D           3           7           6           8           2           8

In [47]:
#按索引排序
df.sort_index(axis=0,ascending=False)

            A  B  C  D
2020-07-28  3  4  7  8
2020-07-27  3  1  5  2
2020-07-26  1  5  5  8
2020-07-25  6  1  5  6
2020-07-24  6  0  5  7
2020-07-23  5  9  9  3

In [48]:
#计算
a=pd.DataFrame([1,2,3])
a

   0
0  1
1  2
2  3

In [49]:
a-2

   0
0 -1
1  0
2  1

In [50]:
b=pd.DataFrame([1,2,3])
a+b

   0
0  2
1  4
2  6

In [53]:
#矩阵运算の矩阵乘法
b=pd.DataFrame(np.random.randint(10,size=(1,3)))
c=a@b
c

    0   1   2
0   6   6   5
1  12  12  10
2  18  18  15

In [54]:
x=np.arange(9)
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [56]:
#缺失值处理
a=pd.DataFrame(np.arange(9).reshape((3,3)))
a

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [58]:
#把前两行的第2列设为空
a.iloc[:2,2]=np.nan
a

   0  1    2
0  0  1  NaN
1  3  4  NaN
2  6  7  8.0

In [59]:
a.dropna()#直接丢掉行

   0  1    2
2  6  7  8.0

In [60]:
a.dropna(axis=1)#直接丢掉列

   0  1
0  0  1
1  3  4
2  6  7

In [61]:
a.dropna(axis=1,how='all')

   0  1    2
0  0  1  NaN
1  3  4  NaN
2  6  7  8.0

In [62]:
a.fillna(value=0)#填充缺失值

   0  1    2
0  0  1  0.0
1  3  4  0.0
2  6  7  8.0

In [63]:
#合并 & 对齐
a=pd.DataFrame(np.zeros((3,4)),columns=['a','b','c','d'])
b=pd.DataFrame(np.zeros((3,4)),columns=['a','b','c','d'])
print(a)
print(b)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0

In [64]:
#垂直合并
pd.concat([a,b])

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0

In [65]:
pd.concat([a,b],ignore_index=True)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0
5  0.0  0.0  0.0  0.0

In [67]:
#水平合并
pd.concat([a,b],axis=1)

     a    b    c    d    a    b    c    d
0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

In [68]:
#加一行
c=pd.Series([1,2,3,4],index=['a','b','c','d'])
a.append(c,ignore_index=True)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  2.0  3.0  4.0

In [69]:
#对其合并，例子暂时省略，蛮好用的，特别是两个数据带有同一个标签的时候，用的时候自己去查
pd.merge

<function pandas.core.reshape.merge.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)>

In [ ]:
#分组，用的时候自己去查

In [70]:
#数据透视表
import seaborn as sns
titanic=sns.load_dataset('titanic')

In [71]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [72]:
#查看不同仓，不同性别 乘客的生存
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447